Ran Plan for project: `new` dir: `terraform/stacks/smartprotection/new` workspace: `dev`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
+ resource "aws_cloudwatch_log_group" "flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 0
      + tags              = {
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
+ resource "aws_db_subnet_group" "database" {
      + arn         = (known after apply)
      + description = "Database subnet group for dev-smart"
      + id          = (known after apply)
      + name        = "dev-smart"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name"        = "dev-smart"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
    }

  # module.vpc.aws_eip.nat[0] will be created
+ resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "dev-smart-eu-west-1a"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[1] will be created
+ resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "dev-smart-eu-west-1b"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc                  = true
    }

  # module.vpc.aws_flow_log.this[0] will be created
+ resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
+ resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "vpc-flow-log-to-cloudwatch-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
+ resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
+ resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+ resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "dev-smart"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+ resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"        = "dev-smart-eu-west-1a"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
+ resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"        = "dev-smart-eu-west-1b"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+ resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
+ resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+ resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "dev-smart-private-eu-west-1a"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+ resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "dev-smart-private-eu-west-1b"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+ resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "dev-smart-public"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
+ resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
+ resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[3] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
+ resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.21.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "dev-smart-db-eu-west-1a"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
+ resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.22.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "dev-smart-db-eu-west-1b"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.11.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "dev-smart-private-eu-west-1a"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.12.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "dev-smart-private-eu-west-1b"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.32.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "dev-smart-private-eu-west-1a"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[3] will be created
+ resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.64.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "dev-smart-private-eu-west-1b"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "dev-smart-public-eu-west-1a"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "dev-smart-public-eu-west-1b"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+ resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.100.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"        = "dev-smart"
          + "environment" = "dev"
          + "project"     = "smart"
          + "terraform"   = "true"
          + "tf_state"    = "new"
        }
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ database_route_table_ids     = [
      + (known after apply),
      + (known after apply),
    ]
+ database_subnets             = [
      + (known after apply),
      + (known after apply),
    ]
+ database_subnets_cidr_blocks = [
      + "10.100.21.0/24",
      + "10.100.22.0/24",
    ]
+ igw_id                       = (known after apply)
+ natgw_ids                    = [
      + (known after apply),
      + (known after apply),
    ]
+ private_route_table_ids      = [
      + (known after apply),
      + (known after apply),
    ]
+ private_subnets              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
+ private_subnets_cidr_blocks  = [
      + "10.100.11.0/24",
      + "10.100.12.0/24",
      + "10.100.32.0/19",
      + "10.100.64.0/19",
    ]
+ public_route_table_ids       = [
      + (known after apply),
    ]
+ public_subnets               = [
      + (known after apply),
      + (known after apply),
    ]
+ public_subnets_cidr_blocks   = [
      + "10.100.1.0/24",
      + "10.100.2.0/24",
    ]
+ vpc_cidr                     = "10.100.0.0/16"
+ vpc_flow_log_id              = (known after apply)
+ vpc_id                       = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p new`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.smartprotection.com/lock?id=sp-aliciaalcalde%252Ftesting-atlantis%252Fterraform%252Fstacks%252Fsmartprotection%252Fnew%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p new`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
